# PlacementCenterY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlacementCenterY Property
ParameterTypeId Class See Also
---
"Center Y"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlacementCenterY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlacementCenterY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlacementCenterY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace